export interface Director {
    position: string,
    isActive: boolean,
    from: string,
    to: string | null,
    name: string,
    inn: string,
}

export const directorsMockData : Director[] = [
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: true,
        from: "2024-08-12T00:00:00+00:00",
        to: null,
        name: "СОКОЛОВ ДАНИИЛ РОМАНОВИЧ",
        inn: "770483920154"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2019-05-10T00:00:00+00:00",
        to: "2024-08-12T00:00:00+00:00",
        name: "ГРОМОВ ТИМОФЕЙ АРТЕМОВИЧ",
        inn: "540812639501"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2016-02-03T00:00:00+00:00",
        to: "2019-05-10T00:00:00+00:00",
        name: "КОРНЕЕВ МАКСИМ ИГОРЕВИЧ",
        inn: "662918450372"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2014-09-18T00:00:00+00:00",
        to: "2016-02-03T00:00:00+00:00",
        name: "БАРАНОВ ЛЕОНИД СЕРГЕЕВИЧ",
        inn: "231507384920"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2012-04-01T00:00:00+00:00",
        to: "2014-09-18T00:00:00+00:00",
        name: "МИРОНОВ ЕГОР ПАВЛОВИЧ",
        inn: "503914782651"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2010-01-15T00:00:00+00:00",
        to: "2012-04-01T00:00:00+00:00",
        name: "ФЕДОРОВ НИКИТА ВЛАДИСЛАВОВИЧ",
        inn: "781624903517"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2008-07-09T00:00:00+00:00",
        to: "2010-01-15T00:00:00+00:00",
        name: "АНДРЕЕВ ПАВЕЛ КОНСТАНТИНОВИЧ",
        inn: "590314782046"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2006-03-22T00:00:00+00:00",
        to: "2008-07-09T00:00:00+00:00",
        name: "ТАРАСОВ ДЕНИС ОЛЕГОВИЧ",
        inn: "667812450963"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2004-11-11T00:00:00+00:00",
        to: "2006-03-22T00:00:00+00:00",
        name: "ЗАЙЦЕВ ИЛЬЯ АНТОНОВИЧ",
        inn: "720634819275"
    },
    {
        position: "ГЕНЕРАЛЬНЫЙ ДИРЕКТОР",
        isActive: false,
        from: "2002-01-10T00:00:00+00:00",
        to: "2004-11-11T00:00:00+00:00",
        name: "ЛОБАНОВ АРТЕМ МИХАЙЛОВИЧ",
        inn: "165903742816"
    }
]